{u'username': u'Chaos Syren', u'hours': 0.1, u'products': 41, u'product_id': u'725280', u'page_order': 0, u'date': u'2017-12-17', u'text': u'This would not be acceptable as an entertainment even back in the day when these graphics were all there was to be had. No effort has been made to bring the player into any story or even entertain.', u'early_access': False, u'page': 1}
{u'username': u'₮ʜᴇ Wᴀʀᴛᴏɴ', u'hours': 51.1, u'products': 769, u'product_id': u'328100', u'page_order': 0, u'date': u'2017-12-27', u'text': u'looks like a facebook game', u'early_access': False, u'page': 1}
{u'username': u'hello?<', u'text': u'Better than Minecraft', u'hours': 14.6, u'date': u'2017-10-16', u'early_access': False, u'found_funny': 2, u'product_id': u'328100', u'page_order': 1, u'compensation': u'Product received for free', u'products': 2, u'page': 1}
{u'username': u'Cyderine916', u'hours': 5.0, u'products': 64, u'product_id': u'35140', u'page_order': 0, u'date': u'2018-01-04', u'text': u'I love and idolized Batman and this game is Masterpiece for me.', u'early_access': False, u'page': 1}
{u'username': u'DarklyThinking', u'text': u"Still worth playing in 2018.\nProbably my favorite batman game overall.\nIt lacks the open world aspect of its sequels but makes up for it with a condensed and tense story.\nGetting 100% of the trophies also didn't feel like a chore(which must be a first for me).", u'hours': 16.6, u'date': u'2018-01-04', u'early_access': False, u'user_id': u'76561198007483075', u'product_id': u'35140', u'page_order': 1, u'products': 577, u'page': 1}
{u'username': u'Teef \U0001f40f', u'text': u'hey thanks for stealing my spritework', u'hours': 0.9, u'date': u'2017-12-03', u'early_access': False, u'found_funny': 1, u'product_id': u'725280', u'page_order': 1, u'products': 923, u'page': 1}
{u'username': u'nd', u'text': u'endless rooms of some underground complex, blood, monsters, hallucinations - simple 3d fps horror game.\ncheap as hell :)', u'hours': 1.0, u'date': u'2017-11-28', u'early_access': False, u'found_funny': 1, u'product_id': u'725280', u'page_order': 2, u'products': 2759, u'page': 1}
{u'username': u'Sneaky_Panda', u'hours': 0.6, u'products': 243, u'product_id': u'725280', u'page_order': 3, u'date': u'2017-11-27', u'text': u"If you take a discount - it's not a bad horror. For their money.", u'early_access': False, u'page': 1}
{u'username': u'jimllfixitok', u'text': u"no sound. icons don't work. re-installed but no joy. played for a while but not the same without these items. checked forums but very little help available. been on their site but game not there ??? asked for refund", u'hours': 1.1, u'date': u'2017-10-16', u'early_access': False, u'user_id': u'76561197970402776', u'product_id': u'707610', u'page_order': 0, u'products': 729, u'page': 1}
{u'username': u'Otomji', u'hours': 1.1, u'products': 399, u'product_id': u'707610', u'page_order': 1, u'date': u'2017-09-17', u'text': u'This bought back fond memories of playing Mahjong Games, had all the features mahjong games used to have, ran like a dream , has a good hint system, just like how it used to be,  , really nice game.', u'early_access': False, u'page': 1}
{u'username': u'Ariman1', u'hours': 13.2, u'products': 1386, u'product_id': u'328100', u'page_order': 2, u'date': u'2017-08-02', u'text': u'Addictive RPG ! Works fine on linux though it has a few minor bugs. I recommed it to turn-based rpg fans.', u'early_access': False, u'page': 1}
{u'username': u'Rejutka Lupex', u'text': u'A nice game, but better not to get started.\nThe problem with this game isn\'t that it\'s bad, the problem is that it isn\'t explained. Maybe there was some tutorial at the beginning, but if so, I\'ve long since forgotten most of what they said.\nThere is no in-game help to explain how the details work - for example the damage mechanic. Obviously it depends on how many skulls you combine, but what else? Enemy armor probably, and some sort of multiplier? Sometimes it seems that the enemy is healing me and then attacking at the same time.\nI\'d like to say "give it a try" if you see it cheap, but I don\'t think it\'s worth it. It does have addictive qualities, and one wants to continue - but every time I start the game, I get frustrated within minutes.\nAlso, and this is a minor nitpick, it seems they only have ONE track for combat music. It\'s nice music, very eerie and fitting. But hearing it constantly is getting old fast.\nIf you want a nice match-3 game, try Gems of War instead. No story to speak of, but it\'s free.', u'hours': 3.8, u'date': u'2017-06-23', u'early_access': False, u'found_funny': 2, u'user_id': u'76561198060686749', u'product_id': u'328100', u'page_order': 3, u'products': 431, u'page': 1}
{u'username': u'Phr0stY_D3mon', u'hours': 2.2, u'products': 1195, u'product_id': u'328100', u'page_order': 4, u'date': u'2017-05-30', u'text': u"Gunspell is an alternate take on the classic match-3 game that we see. It combines matching elements, along with different abilities and items that you need to defeat your opponent, even though the main focus is on matching tiles.\nPros:\n-Easy and enjoyable. Great if you want to take a break and just sit back and relax.\n-Has story elements to it, even though not the best story, it is somewhat enjoyable.\n-Unique matching and item/ability elements add to the experience of the game.\n-Has trading cards available\nCons:\n-Some issues regarding the porting of the game itself, as I've noticed some bugs and that present still\n-For R159 (~$12), the game feels overpriced\nThis is one of the better match-3 type games out there, but not worth full price. Get it on a sale if you enjoy these types of games.\n6/10", u'early_access': False, u'page': 1}
{u'username': u'MR_SERENITY', u'text': u'aweosme game great story and some epic moments.\nand Kevin and Mark delivers the awesome voices as allways.', u'hours': 14.8, u'date': u'2018-01-03', u'early_access': False, u'user_id': u'76561198023491401', u'product_id': u'35140', u'page_order': 2, u'products': 147, u'page': 1}
{u'username': u'Coby', u'hours': 8.9, u'products': 227, u'product_id': u'35140', u'page_order': 3, u'date': u'2018-01-03', u'text': u'Finished the game around 6 hours. Thats only the story and some collectables on the way. If it goes on sale for a couple of dollars why not pick it up. Nice start to the batman franchise.', u'early_access': False, u'page': 1}
{u'username': u'Duha Nubie', u'hours': 11.3, u'products': 73, u'product_id': u'35140', u'page_order': 4, u'date': u'2018-01-03', u'text': u'first debut feel sweet', u'early_access': False, u'page': 1}